def getVar(fac):
    if (fac == 'Биологический факульет 🍃'):
        return 1
    elif (fac == 'Географический факульет 🗺'):
        return 2
    elif (fac == 'Геологический факульет ⛏'):
        return 3
    elif (fac == 'Институт искусств 🎭'):
        return 4
    elif (fac == 'Институт истории и международных отношений  🎫'):
        return 5
    elif (fac == 'Институт физики 🔧'):
        return 6
    elif (fac == 'Институт физической культуры и спорта  🥇'):
        return 7
    elif (fac == 'Институт филологии и журналистики 📜'):
        return 8
    elif (fac == 'Институт химии  👨‍🔬'):
        return 9
    elif (fac == 'Механико-математический факультет 🍻'):
        return 10
    elif (fac == 'Социологический факультет  🌐'):
        return 11
    elif (fac == 'Факультет иностранных языков и лингводидактики 🌍'):
        return 12
    elif (fac == 'Факультет компьютерных наук и информационных технологий  🖥'):
        return 13
    elif (fac == 'Факультет психологии 🤔'):
        return 14
    elif (fac == 'Факультет психолого-педагогического и специального образования  👩‍🏫'):
        return 15
    elif (fac == 'Факультет фундаментальной медицины и медицинских технологий 🏥'):
        return 16
    elif (fac == 'Философский факультет 🤓'):
        return 17
    elif (fac == 'Экономический факультет 📈'):
        return 18
    elif (fac == 'Юридический факультет  ⚖'):
        return 19
    else:
        return -1
